<?php
$t = [
    'dashboard_title' => 'لوحة تحكم المحفظ',
    'welcome' => 'مرحبًا',
    'add_lesson' => '➕ إضافة درس جديد',
    'your_students' => '📚 طلابك',
    'name' => 'الاسم',
    'grade' => 'الصف الدراسي',
    'no_students' => 'لا يوجد طلاب مسجلين حاليًا.',
    'language_toggle' => 'English',
    
    // جديد:
    'profile_settings' => '⚙️ إعدادات الحساب',
    'logout' => '🚪 تسجيل الخروج',
    'dashboard_link' => '🏠 الصفحة الرئيسية',
    'teacher_dashboard' => '🧑‍🏫 لوحة تحكم المحفظ',
    'your_lessons_page_title' => '📚 دورسك',
    'add_lesson_page_title' => '📚 إضافة درس جديد',
    'edit_lesson_page_title' => '📚 تعديل درس جديد',
    'list_lessons' => '📚 دورسك',
    'setting_teacher_page_title' => '⚙️ إدارة الحساب المحفظ',
    'admin_dashboard' => '🧑‍🏫 لوحة تحكم الاداره',
    'manage_subscriptions_page_title' => ' إدارة الاشتراكات',
    'dashboard' => 'لوحة التحكم',
    'home' => 'الصفحة الرئيسية',
];